In [1]:
## Data Analysis libraries

import pandas as pd
import numpy as np

## Data Visualization libraries

import matplotlib.pyplot as plt
import seaborn as sns

## For a clean jupyter notebook 

import warnings
warnings.filterwarnings('ignore')

## Load the dataset

In [6]:
data = pd.read_csv('Social_Network_Ads.csv')
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0

In [7]:
data.shape

(10, 5)

## Seperate  X and y

In [9]:
X = data.drop('Purchased', axis = 1)  ## axis = 1 is for columns and axis = 0 is for rows
y = data['Purchased']

In [10]:
X

    User ID  Gender  Age  EstimatedSalary
0  15624510    Male   19            19000
1  15810944    Male   35            20000
2  15668575  Female   26            43000
3  15603246  Female   27            57000
4  15804002    Male   19            76000
5  15728773    Male   27            58000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
8  15600575    Male   25            33000
9  15727311  Female   35            65000

In [11]:
y

0    0
1    1
2    0
3    1
4    0
5    0
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int64

## Train Test Split

In [34]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42)

In [35]:
X_train

    User ID  Gender  Age  EstimatedSalary
5  15728773    Male   27            58000
0  15624510    Male   19            19000
7  15694829  Female   32           150000
2  15668575  Female   26            43000
9  15727311  Female   35            65000
4  15804002    Male   19            76000
3  15603246  Female   27            57000
6  15598044  Female   27            84000

In [36]:
X_test

    User ID Gender  Age  EstimatedSalary
8  15600575   Male   25            33000
1  15810944   Male   35            20000

In [29]:
y_train

5    0
0    0
7    1
2    0
9    1
4    0
3    1
6    0
Name: Purchased, dtype: int64

In [30]:
y_test

8    0
1    1
Name: Purchased, dtype: int64

## Notes for Train Test split

1. The enitre data is divided into 4 parts, namely, X_train, X_test, y_train, y_test
2. The ratio for train test split can be either 80 % train - 20 % test, 70 % train - 30 % test, 90 % train - 10 % test, 75 % train - 25 % test, etc.
3. The idea for train test split is that max data should be present in train set and minimum data should be present in test set
4. Random state is used to stabilize the split
5. Train test split is also called as Hold One Out Cross Validation technique